{
  "timestamp": "2026-06-28T21:27:02Z",
  "training_duration_s": 17.33221197128296,
  "epochs_trained": 46,
  "split_type": "chronological",
  "test_fraction": 0.2,
  "seed": 42,
  "classes": [
    "none",
    "swipe_left",
    "swipe_right",
    "circle_cw",
    "circle_ccw",
    "fist",
    "jerk_down",
    "jerk_up"
  ],
  "channels": [
    "IMU1_accX",
    "IMU1_accY",
    "IMU1_accZ",
    "IMU1_gyrX",
    "IMU1_gyrY",
    "IMU1_gyrZ",
    "IMU2_accX",
    "IMU2_accY",
    "IMU2_accZ",
    "IMU2_gyrX",
    "IMU2_gyrY",
    "IMU2_gyrZ",
    "IMU1_roll",
    "IMU1_pitch"
  ],
  "wrist_channels": [
    "IMU1_accX",
    "IMU1_accY",
    "IMU1_accZ",
    "IMU1_gyrX",
    "IMU1_gyrY",
    "IMU1_gyrZ",
    "IMU1_roll",
    "IMU1_pitch"
  ],
  "finger_channels": [
    "IMU2_accX",
    "IMU2_accY",
    "IMU2_accZ",
    "IMU2_gyrX",
    "IMU2_gyrY",
    "IMU2_gyrZ"
  ],
  "feature_names": [],
  "final_metrics": {
    "train_loss": 0.003879387164488435,
    "train_acc": 1.0,
    "val_loss": 0.004145490471273661,
    "val_acc": 1.0,
    "test_accuracy": 1.0
  },
  "pipeline_config": {
    "sample_rate_hz": 100.0,
    "window_size": 150,
    "pad_mode": "edge",
    "jitter_range": 10,
    "calibration": {
      "enabled": true,
      "remove_gyro_bias": true,
      "normalize_acc_to_g": true,
      "remove_acc_bias": false,
      "anchor_samples": 0
    },
    "filters": {
      "enabled": true,
      "acc_filter": "lowpass",
      "acc_cutoff_hz": 8.0,
      "gyro_filter": "lowpass",
      "gyro_cutoff_hz": 12.0,
      "order": 2,
      "remove_gravity": false,
      "gravity_cutoff_hz": 0.5,
      "replace_acc_with_linear": false
    },
    "orientation": {
      "enabled": true,
      "method": "complementary",
      "imus": [
        "IMU1"
      ],
      "alpha": 0.98,
      "degrees": true,
      "kalman_q_angle": 0.001,
      "kalman_q_bias": 0.003,
      "kalman_r_measure": 0.03
    },
    "features": {
      "imus": [
        "IMU1",
        "IMU2"
      ],
      "include_acc": true,
      "include_gyro": true,
      "include_acc_magnitude": false,
      "include_gyro_magnitude": false,
      "include_diff_acc": false,
      "include_diff_gyro": false,
      "include_orientation": true,
      "cross_correlation": false,
      "statistics": false,
      "include_linear_jerk": false,
      "include_angular_acceleration": false,
      "include_relative_acceleration": false,
      "include_relative_rotation": false,
      "include_relative_yaw": false,
      "include_accelerometer_magnitude": false,
      "include_gyroscope_magnitude": false,
      "include_gravity_free_linear_acceleration": false
    }
  },
  "feature_toggles": {
    "IMU1_linear_jerkX": false,
    "IMU1_linear_jerkZ": false,
    "IMU2_linear_jerkZ": false,
    "IMU1_angular_accelerationY": false,
    "IMU1_angular_accelerationZ": false,
    "IMU2_angular_accelerationY": false,
    "IMU1_accX": true,
    "IMU1_accZ": true,
    "IMU1_gyrX": true,
    "IMU1_pitch": true,
    "IMU2_accX": true,
    "IMU2_accY": true,
    "IMU2_accZ": true,
    "IMU2_gyrX": true,
    "diff_accX": false,
    "diff_accZ": false,
    "IMU1_gyr_mag": false,
    "IMU1_accY": true,
    "IMU1_gyrY": true,
    "IMU1_gyrZ": true,
    "IMU1_acc_mag": false,
    "IMU1_roll": true,
    "IMU1_relative_yaw": false,
    "IMU1_linear_jerkY": false,
    "IMU1_angular_accelerationX": false,
    "IMU2_gyrY": true,
    "IMU2_gyrZ": true,
    "IMU2_gyr_mag": false,
    "IMU2_acc_mag": false,
    "IMU2_relative_yaw": false,
    "IMU2_linear_jerkX": false,
    "IMU2_linear_jerkY": false,
    "IMU2_angular_accelerationX": false,
    "IMU2_angular_accelerationZ": false,
    "diff_accY": false,
    "diff_gyrX": false,
    "diff_gyrY": false,
    "diff_gyrZ": false
  },
  "features_selection": {
    "default_selected_features": [
      "IMU1_accX",
      "IMU1_accZ",
      "IMU1_gyrX",
      "IMU1_pitch",
      "IMU2_accX",
      "IMU2_accY",
      "IMU2_accZ",
      "IMU2_gyrX",
      "IMU1_accY",
      "IMU1_gyrY",
      "IMU1_gyrZ",
      "IMU1_roll",
      "IMU2_gyrY",
      "IMU2_gyrZ"
    ],
    "default_deselected_features": [
      "IMU1_linear_jerkX",
      "IMU1_linear_jerkZ",
      "IMU2_linear_jerkZ",
      "IMU1_angular_accelerationY",
      "IMU1_angular_accelerationZ",
      "IMU2_angular_accelerationY",
      "diff_accX",
      "diff_accZ",
      "IMU1_gyr_mag",
      "IMU1_acc_mag",
      "IMU1_relative_yaw",
      "IMU1_linear_jerkY",
      "IMU1_angular_accelerationX",
      "IMU2_gyr_mag",
      "IMU2_acc_mag",
      "IMU2_relative_yaw",
      "IMU2_linear_jerkX",
      "IMU2_linear_jerkY",
      "IMU2_angular_accelerationX",
      "IMU2_angular_accelerationZ",
      "diff_accY",
      "diff_gyrX",
      "diff_gyrY",
      "diff_gyrZ"
    ]
  },
  "early_stopped": false,
  "split_info": {
    "strategy": "chronological",
    "total_samples": 1950,
    "train_size_abs": 1365,
    "val_size_abs": 195,
    "test_size_abs": 390,
    "train_fraction_real": 0.7,
    "val_fraction_real": 0.1,
    "test_fraction_real": 0.2
  },
  "model_structure": {
    "total_parameters": 24264,
    "layers": [
      {
        "layer_name": "wrist_input",
        "class_name": "InputLayer",
        "output_shape": [
          null,
          150,
          8
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "finger_input",
        "class_name": "InputLayer",
        "output_shape": [
          null,
          150,
          6
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "wrist_conv1",
        "class_name": "Conv1D",
        "output_shape": [
          null,
          150,
          32
        ],
        "parameter_count": 1312
      },
      {
        "layer_name": "finger_conv1",
        "class_name": "Conv1D",
        "output_shape": [
          null,
          150,
          32
        ],
        "parameter_count": 992
      },
      {
        "layer_name": "wrist_bn1",
        "class_name": "BatchNormalization",
        "output_shape": [
          null,
          150,
          32
        ],
        "parameter_count": 128
      },
      {
        "layer_name": "finger_bn1",
        "class_name": "BatchNormalization",
        "output_shape": [
          null,
          150,
          32
        ],
        "parameter_count": 128
      },
      {
        "layer_name": "wrist_relu1",
        "class_name": "ReLU",
        "output_shape": [
          null,
          150,
          32
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "finger_relu1",
        "class_name": "ReLU",
        "output_shape": [
          null,
          150,
          32
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "wrist_pool1",
        "class_name": "MaxPooling1D",
        "output_shape": [
          null,
          75,
          32
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "finger_pool1",
        "class_name": "MaxPooling1D",
        "output_shape": [
          null,
          75,
          32
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "wrist_conv2",
        "class_name": "Conv1D",
        "output_shape": [
          null,
          75,
          64
        ],
        "parameter_count": 6208
      },
      {
        "layer_name": "finger_conv2",
        "class_name": "Conv1D",
        "output_shape": [
          null,
          75,
          64
        ],
        "parameter_count": 6208
      },
      {
        "layer_name": "wrist_bn2",
        "class_name": "BatchNormalization",
        "output_shape": [
          null,
          75,
          64
        ],
        "parameter_count": 256
      },
      {
        "layer_name": "finger_bn2",
        "class_name": "BatchNormalization",
        "output_shape": [
          null,
          75,
          64
        ],
        "parameter_count": 256
      },
      {
        "layer_name": "wrist_relu2",
        "class_name": "ReLU",
        "output_shape": [
          null,
          75,
          64
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "finger_relu2",
        "class_name": "ReLU",
        "output_shape": [
          null,
          75,
          64
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "wrist_gap",
        "class_name": "GlobalAveragePooling1D",
        "output_shape": [
          null,
          64
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "finger_gap",
        "class_name": "GlobalAveragePooling1D",
        "output_shape": [
          null,
          64
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "concat_branch",
        "class_name": "Concatenate",
        "output_shape": [
          null,
          128
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "classifier_dense",
        "class_name": "Dense",
        "output_shape": [
          null,
          64
        ],
        "parameter_count": 8256
      },
      {
        "layer_name": "classifier_dropout",
        "class_name": "Dropout",
        "output_shape": [
          null,
          64
        ],
        "parameter_count": 0
      },
      {
        "layer_name": "softmax_output",
        "class_name": "Dense",
        "output_shape": [
          null,
          8
        ],
        "parameter_count": 520
      }
    ]
  }
}