{
  "timestamp": "training_session_split_test_leave-session-out_repeat",
  "model_name": "late_fusion_cnn_test",
  "training_duration_s": 77.2324001789093,
  "epochs_trained": 70,
  "early_stopped": false,
  "classes": [
    "none",
    "swipe_left",
    "swipe_right",
    "circle_cw",
    "circle_ccw",
    "fist",
    "jerk_down",
    "jerk_up"
  ],
  "channels": [
    "IMU1_accX",
    "IMU1_accZ",
    "IMU1_gyrX",
    "IMU1_pitch",
    "IMU2_accX",
    "IMU2_accY",
    "IMU2_accZ",
    "IMU2_gyrX",
    "diff_accX",
    "diff_accZ",
    "IMU1_gyr_mag",
    "IMU1_gyrY",
    "IMU1_acc_mag",
    "IMU1_relative_yaw",
    "IMU1_linear_jerkY",
    "IMU2_gyrZ",
    "IMU2_acc_mag",
    "IMU2_linear_jerkX",
    "IMU2_linear_jerkY",
    "IMU2_angular_accelerationX",
    "diff_accY",
    "diff_gyrY",
    "diff_gyrZ"
  ],
  "wrist_channels": [
    "IMU1_accX",
    "IMU1_accZ",
    "IMU1_gyrX",
    "IMU1_pitch",
    "IMU1_gyr_mag",
    "IMU1_gyrY",
    "IMU1_acc_mag",
    "IMU1_relative_yaw",
    "IMU1_linear_jerkY"
  ],
  "finger_channels": [
    "IMU2_accX",
    "IMU2_accY",
    "IMU2_accZ",
    "IMU2_gyrX",
    "diff_accX",
    "diff_accZ",
    "IMU2_gyrZ",
    "IMU2_acc_mag",
    "IMU2_linear_jerkX",
    "IMU2_linear_jerkY",
    "IMU2_angular_accelerationX",
    "diff_accY",
    "diff_gyrY",
    "diff_gyrZ"
  ],
  "feature_names": [],
  "feature_toggles": {
    "IMU1_linear_jerkX": false,
    "IMU1_linear_jerkZ": false,
    "IMU2_linear_jerkZ": false,
    "IMU1_angular_accelerationY": false,
    "IMU1_angular_accelerationZ": false,
    "IMU2_angular_accelerationY": false,
    "IMU1_accX": true,
    "IMU1_accZ": true,
    "IMU1_gyrX": true,
    "IMU1_pitch": true,
    "IMU2_accX": true,
    "IMU2_accY": true,
    "IMU2_accZ": true,
    "IMU2_gyrX": true,
    "diff_accX": true,
    "diff_accZ": true,
    "IMU1_gyr_mag": true,
    "IMU1_accY": false,
    "IMU1_gyrY": true,
    "IMU1_gyrZ": false,
    "IMU1_acc_mag": true,
    "IMU1_roll": false,
    "IMU1_relative_yaw": true,
    "IMU1_linear_jerkY": true,
    "IMU1_angular_accelerationX": false,
    "IMU2_gyrY": false,
    "IMU2_gyrZ": true,
    "IMU2_gyr_mag": false,
    "IMU2_acc_mag": true,
    "IMU2_relative_yaw": false,
    "IMU2_linear_jerkX": true,
    "IMU2_linear_jerkY": true,
    "IMU2_angular_accelerationX": true,
    "IMU2_angular_accelerationZ": false,
    "diff_accY": true,
    "diff_gyrX": false,
    "diff_gyrY": true,
    "diff_gyrZ": true
  },
  "features_selection": {
    "default_selected_features": [
      "IMU1_accX",
      "IMU1_accZ",
      "IMU1_gyrX",
      "IMU1_pitch",
      "IMU2_accX",
      "IMU2_accY",
      "IMU2_accZ",
      "IMU2_gyrX",
      "diff_accX",
      "diff_accZ",
      "IMU1_gyr_mag",
      "IMU1_gyrY",
      "IMU1_acc_mag",
      "IMU1_relative_yaw",
      "IMU1_linear_jerkY",
      "IMU2_gyrZ",
      "IMU2_acc_mag",
      "IMU2_linear_jerkX",
      "IMU2_linear_jerkY",
      "IMU2_angular_accelerationX",
      "diff_accY",
      "diff_gyrY",
      "diff_gyrZ"
    ],
    "default_deselected_features": [
      "IMU1_linear_jerkX",
      "IMU1_linear_jerkZ",
      "IMU2_linear_jerkZ",
      "IMU1_angular_accelerationY",
      "IMU1_angular_accelerationZ",
      "IMU2_angular_accelerationY",
      "IMU1_accY",
      "IMU1_gyrZ",
      "IMU1_roll",
      "IMU1_angular_accelerationX",
      "IMU2_gyrY",
      "IMU2_gyr_mag",
      "IMU2_relative_yaw",
      "IMU2_angular_accelerationZ",
      "diff_gyrX"
    ]
  },
  "model_structure": {
    "total_parameters": 25704,
    "layers": [
      {
        "layer_name": "wrist_input",
        "class_name": "InputLayer",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "finger_input",
        "class_name": "InputLayer",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "wrist_conv1",
        "class_name": "Conv1D",
        "output_shape": null,
        "parameter_count": 1472
      },
      {
        "layer_name": "finger_conv1",
        "class_name": "Conv1D",
        "output_shape": null,
        "parameter_count": 2272
      },
      {
        "layer_name": "wrist_bn1",
        "class_name": "BatchNormalization",
        "output_shape": null,
        "parameter_count": 128
      },
      {
        "layer_name": "finger_bn1",
        "class_name": "BatchNormalization",
        "output_shape": null,
        "parameter_count": 128
      },
      {
        "layer_name": "wrist_relu1",
        "class_name": "ReLU",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "finger_relu1",
        "class_name": "ReLU",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "wrist_pool1",
        "class_name": "MaxPooling1D",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "finger_pool1",
        "class_name": "MaxPooling1D",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "wrist_conv2",
        "class_name": "Conv1D",
        "output_shape": null,
        "parameter_count": 6208
      },
      {
        "layer_name": "finger_conv2",
        "class_name": "Conv1D",
        "output_shape": null,
        "parameter_count": 6208
      },
      {
        "layer_name": "wrist_bn2",
        "class_name": "BatchNormalization",
        "output_shape": null,
        "parameter_count": 256
      },
      {
        "layer_name": "finger_bn2",
        "class_name": "BatchNormalization",
        "output_shape": null,
        "parameter_count": 256
      },
      {
        "layer_name": "wrist_relu2",
        "class_name": "ReLU",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "finger_relu2",
        "class_name": "ReLU",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "wrist_gap",
        "class_name": "GlobalAveragePooling1D",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "finger_gap",
        "class_name": "GlobalAveragePooling1D",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "concat_branch",
        "class_name": "Concatenate",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "classifier_dense",
        "class_name": "Dense",
        "output_shape": null,
        "parameter_count": 8256
      },
      {
        "layer_name": "classifier_dropout",
        "class_name": "Dropout",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "softmax_output",
        "class_name": "Dense",
        "output_shape": null,
        "parameter_count": 520
      }
    ]
  },
  "machine_info": {
    "hostname": "MacBook-Pro.fritz.box",
    "os": "Darwin-25.5.0",
    "cpu": "arm",
    "gpu": "MPS",
    "ram_gb": 64.0
  },
  "training_parameters": {
    "epochs": 70,
    "batch_size": 32,
    "learning_rate": 0.001,
    "split_type": "leave-session-out",
    "test_fraction": 0.2,
    "val_fraction": 0.1,
    "seed": 42,
    "augment_rotation": 25.0,
    "jitter_range": 0,
    "sessions_used": [
      "#",
      "session_1782600797",
      "session_1782663416",
      "session_1782663628",
      "session_1782676777",
      "session_1782679027",
      "session_1782751360",
      "session_1782751666",
      "session_1782829539",
      "session_1782829902",
      "session_1782830502",
      "session_1782830800",
      "session_1782831291",
      "session_1782831658",
      "session_1782845000",
      "session_1782845304",
      "session_1782845686",
      "session_1782846044",
      "session_1782846444",
      "session_1782846877",
      "test_data",
      "validation_data"
    ],
    "conv_filters": [
      32,
      64
    ],
    "dense_units": 64
  },
  "split_info": {
    "strategy": "leave-session-out",
    "total_samples": 2351,
    "train_size_abs": 1600,
    "val_size_abs": 250,
    "test_size_abs": 501,
    "train_fraction_real": 0.680561463207146,
    "val_fraction_real": 0.10633772862611654,
    "test_fraction_real": 0.21310080816673757,
    "train_sessions": [
      "#",
      "session_1782600797",
      "session_1782663416",
      "session_1782663628",
      "session_1782676777",
      "session_1782679027",
      "session_1782751360",
      "session_1782751666",
      "session_1782829539",
      "session_1782829902",
      "session_1782830502",
      "session_1782830800",
      "session_1782831291",
      "session_1782831658",
      "session_1782845000",
      "session_1782845304",
      "session_1782845686",
      "session_1782846044",
      "session_1782846444",
      "session_1782846877"
    ],
    "val_sessions": [
      "validation_data"
    ],
    "test_sessions": [
      "test_data"
    ]
  },
  "performance": {
    "best_epoch": 53,
    "train_accuracy": 0.9987499713897705,
    "train_loss": 0.017218131572008133,
    "val_accuracy": 0.9959999918937683,
    "val_loss": 0.015264670364558697,
    "val_f1_score": 0.9917686722726239
  },
  "evaluation": {
    "accuracy": 0.9900199600798403,
    "macro_avg": {
      "precision": 0.9896289533151353,
      "recall": 0.9941887417218542,
      "f1-score": 0.9917686722726239,
      "support": 501.0
    },
    "weighted_avg": {
      "precision": 0.9903575826219994,
      "recall": 0.9900199600798403,
      "f1-score": 0.9900568976014914,
      "support": 501.0
    },
    "per_class_metrics": {
      "none": {
        "precision": 0.9932432432432432,
        "recall": 0.9735099337748344,
        "f1-score": 0.9832775919732442,
        "support": 151.0
      },
      "swipe_left": {
        "precision": 1.0,
        "recall": 0.98,
        "f1-score": 0.98989898989899,
        "support": 50.0
      },
      "swipe_right": {
        "precision": 0.9803921568627451,
        "recall": 1.0,
        "f1-score": 0.9900990099009901,
        "support": 50.0
      },
      "circle_cw": {
        "precision": 1.0,
        "recall": 1.0,
        "f1-score": 1.0,
        "support": 50.0
      },
      "circle_ccw": {
        "precision": 1.0,
        "recall": 1.0,
        "f1-score": 1.0,
        "support": 50.0
      },
      "fist": {
        "precision": 1.0,
        "recall": 1.0,
        "f1-score": 1.0,
        "support": 50.0
      },
      "jerk_down": {
        "precision": 0.9433962264150944,
        "recall": 1.0,
        "f1-score": 0.970873786407767,
        "support": 50.0
      },
      "jerk_up": {
        "precision": 1.0,
        "recall": 1.0,
        "f1-score": 1.0,
        "support": 50.0
      }
    }
  },
  "pipeline_config": {
    "sample_rate_hz": 100.0,
    "window_size": 150,
    "pad_mode": "edge",
    "jitter_range": 0,
    "calibration": {
      "enabled": true,
      "remove_gyro_bias": true,
      "normalize_acc_to_g": true,
      "remove_acc_bias": false,
      "anchor_samples": 0
    },
    "filters": {
      "enabled": true,
      "acc_filter": "lowpass",
      "acc_cutoff_hz": 8.0,
      "gyro_filter": "lowpass",
      "gyro_cutoff_hz": 12.0,
      "order": 2,
      "remove_gravity": false,
      "gravity_cutoff_hz": 0.5,
      "replace_acc_with_linear": false
    },
    "orientation": {
      "enabled": true,
      "method": "complementary",
      "imus": [
        "IMU1",
        "IMU2"
      ],
      "alpha": 0.98,
      "degrees": true,
      "kalman_q_angle": 0.001,
      "kalman_q_bias": 0.003,
      "kalman_r_measure": 0.03
    },
    "features": {
      "imus": [
        "IMU1",
        "IMU2"
      ],
      "include_acc": true,
      "include_gyro": true,
      "include_acc_magnitude": true,
      "include_gyro_magnitude": true,
      "include_diff_acc": true,
      "include_diff_gyro": true,
      "include_orientation": true,
      "cross_correlation": false,
      "statistics": false,
      "include_linear_jerk": true,
      "include_angular_acceleration": true,
      "include_relative_acceleration": false,
      "include_relative_rotation": false,
      "include_relative_yaw": true,
      "include_accelerometer_magnitude": false,
      "include_gyroscope_magnitude": false,
      "include_gravity_free_linear_acceleration": true
    }
  }
}