{
  "timestamp": "20260701_223942",
  "model_name": "late_fusion_cnn_test",
  "training_duration_s": 27.743144750595093,
  "epochs_trained": 50,
  "early_stopped": false,
  "classes": [
    "none",
    "swipe_left",
    "swipe_right",
    "circle_cw",
    "circle_ccw",
    "fist",
    "jerk_down",
    "jerk_up"
  ],
  "channels": [
    "IMU1_accX",
    "IMU1_accY",
    "IMU1_accZ",
    "IMU1_gyrX",
    "IMU1_gyrY",
    "IMU1_gyrZ",
    "IMU2_accX",
    "IMU2_accY",
    "IMU2_accZ",
    "IMU2_gyrX",
    "IMU2_gyrY",
    "IMU2_gyrZ"
  ],
  "wrist_channels": [
    "IMU1_accX",
    "IMU1_accY",
    "IMU1_accZ",
    "IMU1_gyrX",
    "IMU1_gyrY",
    "IMU1_gyrZ"
  ],
  "finger_channels": [
    "IMU2_accX",
    "IMU2_accY",
    "IMU2_accZ",
    "IMU2_gyrX",
    "IMU2_gyrY",
    "IMU2_gyrZ"
  ],
  "feature_names": [],
  "feature_toggles": {
    "IMU1_linear_jerkX": false,
    "IMU1_linear_jerkZ": false,
    "IMU2_linear_jerkZ": false,
    "IMU1_angular_accelerationY": false,
    "IMU1_angular_accelerationZ": false,
    "IMU2_angular_accelerationY": false,
    "IMU1_accX": true,
    "IMU1_accZ": true,
    "IMU1_gyrX": true,
    "IMU1_pitch": false,
    "IMU2_accX": true,
    "IMU2_accY": true,
    "IMU2_accZ": true,
    "IMU2_gyrX": true,
    "diff_accX": false,
    "diff_accZ": false,
    "IMU1_gyr_mag": false,
    "IMU1_accY": true,
    "IMU1_gyrY": true,
    "IMU1_gyrZ": true,
    "IMU1_acc_mag": false,
    "IMU1_roll": false,
    "IMU1_relative_yaw": false,
    "IMU1_linear_jerkY": false,
    "IMU1_angular_accelerationX": false,
    "IMU2_gyrY": true,
    "IMU2_gyrZ": true,
    "IMU2_gyr_mag": false,
    "IMU2_acc_mag": false,
    "IMU2_relative_yaw": false,
    "IMU2_linear_jerkX": false,
    "IMU2_linear_jerkY": false,
    "IMU2_angular_accelerationX": false,
    "IMU2_angular_accelerationZ": false,
    "diff_accY": false,
    "diff_gyrX": false,
    "diff_gyrY": false,
    "diff_gyrZ": false
  },
  "features_selection": {
    "default_selected_features": [
      "IMU1_accX",
      "IMU1_accZ",
      "IMU1_gyrX",
      "IMU2_accX",
      "IMU2_accY",
      "IMU2_accZ",
      "IMU2_gyrX",
      "IMU1_accY",
      "IMU1_gyrY",
      "IMU1_gyrZ",
      "IMU2_gyrY",
      "IMU2_gyrZ"
    ],
    "default_deselected_features": [
      "IMU1_linear_jerkX",
      "IMU1_linear_jerkZ",
      "IMU2_linear_jerkZ",
      "IMU1_angular_accelerationY",
      "IMU1_angular_accelerationZ",
      "IMU2_angular_accelerationY",
      "IMU1_pitch",
      "diff_accX",
      "diff_accZ",
      "IMU1_gyr_mag",
      "IMU1_acc_mag",
      "IMU1_roll",
      "IMU1_relative_yaw",
      "IMU1_linear_jerkY",
      "IMU1_angular_accelerationX",
      "IMU2_gyr_mag",
      "IMU2_acc_mag",
      "IMU2_relative_yaw",
      "IMU2_linear_jerkX",
      "IMU2_linear_jerkY",
      "IMU2_angular_accelerationX",
      "IMU2_angular_accelerationZ",
      "diff_accY",
      "diff_gyrX",
      "diff_gyrY",
      "diff_gyrZ"
    ]
  },
  "model_structure": {
    "total_parameters": 1784,
    "layers": [
      {
        "layer_name": "wrist_input",
        "class_name": "InputLayer",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "finger_input",
        "class_name": "InputLayer",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "wrist_conv1",
        "class_name": "Conv1D",
        "output_shape": null,
        "parameter_count": 496
      },
      {
        "layer_name": "finger_conv1",
        "class_name": "Conv1D",
        "output_shape": null,
        "parameter_count": 496
      },
      {
        "layer_name": "wrist_bn1",
        "class_name": "BatchNormalization",
        "output_shape": null,
        "parameter_count": 64
      },
      {
        "layer_name": "finger_bn1",
        "class_name": "BatchNormalization",
        "output_shape": null,
        "parameter_count": 64
      },
      {
        "layer_name": "wrist_relu1",
        "class_name": "ReLU",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "finger_relu1",
        "class_name": "ReLU",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "wrist_gap",
        "class_name": "GlobalAveragePooling1D",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "finger_gap",
        "class_name": "GlobalAveragePooling1D",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "concat_branch",
        "class_name": "Concatenate",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "classifier_dense",
        "class_name": "Dense",
        "output_shape": null,
        "parameter_count": 528
      },
      {
        "layer_name": "classifier_dropout",
        "class_name": "Dropout",
        "output_shape": null,
        "parameter_count": 0
      },
      {
        "layer_name": "softmax_output",
        "class_name": "Dense",
        "output_shape": null,
        "parameter_count": 136
      }
    ]
  },
  "machine_info": {
    "hostname": "Bestever",
    "os": "Windows-10",
    "cpu": "Intel64 Family 6 Model 189 Stepping 1, GenuineIntel",
    "gpu": "CUDA",
    "ram_gb": 64.0
  },
  "training_parameters": {
    "epochs": 50,
    "batch_size": 32,
    "learning_rate": 0.001,
    "split_type": "chronological",
    "test_fraction": 0.2,
    "val_fraction": 0.1,
    "seed": 42,
    "augment_rotation": 0.0,
    "jitter_range": 0,
    "sessions_used": [
      "#",
      "session_1782600797",
      "session_1782663416",
      "session_1782663628",
      "session_1782676777",
      "session_1782679027",
      "session_1782751360",
      "session_1782751666",
      "session_1782829539",
      "session_1782829902",
      "session_1782830502",
      "session_1782830800",
      "session_1782831291",
      "session_1782831658",
      "session_1782845000",
      "session_1782845304",
      "session_1782845686",
      "session_1782846044",
      "session_1782846444",
      "session_1782846877",
      "test_data",
      "validation_data"
    ],
    "conv_filters": [
      16
    ],
    "dense_units": 16
  },
  "split_info": {
    "strategy": "chronological",
    "total_samples": 2351,
    "train_size_abs": 1649,
    "val_size_abs": 232,
    "test_size_abs": 470,
    "train_fraction_real": 0.7014036580178648,
    "val_fraction_real": 0.09868141216503616,
    "test_fraction_real": 0.1999149298170991,
    "train_sessions": [
      "#",
      "session_1782600797",
      "session_1782663416",
      "session_1782663628",
      "session_1782676777",
      "session_1782679027",
      "session_1782751360",
      "session_1782751666",
      "session_1782829539",
      "session_1782829902",
      "session_1782830502",
      "session_1782830800",
      "session_1782831291",
      "session_1782831658",
      "session_1782845000",
      "session_1782845304",
      "session_1782845686",
      "session_1782846044",
      "session_1782846444",
      "session_1782846877",
      "test_data"
    ],
    "val_sessions": [
      "session_1782846877",
      "test_data"
    ],
    "test_sessions": [
      "test_data",
      "validation_data"
    ]
  },
  "performance": {
    "best_epoch": 50,
    "train_accuracy": 0.8526379466056824,
    "train_loss": 0.38029909133911133,
    "val_accuracy": 0.9913793206214905,
    "val_loss": 0.06702295690774918,
    "val_f1_score": 0.9856699158329594
  },
  "evaluation": {
    "accuracy": 0.9829787234042553,
    "macro_avg": {
      "precision": 0.9840173102851995,
      "recall": 0.9876344086021506,
      "f1-score": 0.9856699158329594,
      "support": 470.0
    },
    "weighted_avg": {
      "precision": 0.9831688701224974,
      "recall": 0.9829787234042553,
      "f1-score": 0.9829447379632394,
      "support": 470.0
    },
    "per_class_metrics": {
      "none": {
        "precision": 0.9803921568627451,
        "recall": 0.967741935483871,
        "f1-score": 0.974025974025974,
        "support": 155.0
      },
      "swipe_left": {
        "precision": 0.9777777777777777,
        "recall": 0.9777777777777777,
        "f1-score": 0.9777777777777777,
        "support": 45.0
      },
      "swipe_right": {
        "precision": 0.9782608695652174,
        "recall": 1.0,
        "f1-score": 0.989010989010989,
        "support": 45.0
      },
      "circle_cw": {
        "precision": 1.0,
        "recall": 0.9555555555555556,
        "f1-score": 0.9772727272727273,
        "support": 45.0
      },
      "circle_ccw": {
        "precision": 1.0,
        "recall": 1.0,
        "f1-score": 1.0,
        "support": 45.0
      },
      "fist": {
        "precision": 1.0,
        "recall": 1.0,
        "f1-score": 1.0,
        "support": 45.0
      },
      "jerk_down": {
        "precision": 0.9782608695652174,
        "recall": 1.0,
        "f1-score": 0.989010989010989,
        "support": 45.0
      },
      "jerk_up": {
        "precision": 0.9574468085106383,
        "recall": 1.0,
        "f1-score": 0.9782608695652174,
        "support": 45.0
      }
    }
  },
  "pipeline_config": {
    "sample_rate_hz": 100.0,
    "window_size": 150,
    "pad_mode": "edge",
    "jitter_range": 0,
    "calibration": {
      "enabled": true,
      "remove_gyro_bias": true,
      "normalize_acc_to_g": true,
      "remove_acc_bias": false,
      "anchor_samples": 0
    },
    "filters": {
      "enabled": true,
      "acc_filter": "none",
      "acc_cutoff_hz": 8.0,
      "gyro_filter": "none",
      "gyro_cutoff_hz": 12.0,
      "order": 2,
      "remove_gravity": false,
      "gravity_cutoff_hz": 0.5,
      "replace_acc_with_linear": false
    },
    "orientation": {
      "enabled": true,
      "method": "none",
      "imus": [
        "IMU1",
        "IMU2"
      ],
      "alpha": 0.98,
      "degrees": true,
      "kalman_q_angle": 0.001,
      "kalman_q_bias": 0.003,
      "kalman_r_measure": 0.03
    },
    "features": {
      "imus": [
        "IMU1",
        "IMU2"
      ],
      "include_acc": true,
      "include_gyro": true,
      "include_acc_magnitude": false,
      "include_gyro_magnitude": false,
      "include_diff_acc": false,
      "include_diff_gyro": false,
      "include_orientation": true,
      "cross_correlation": false,
      "statistics": false,
      "include_linear_jerk": false,
      "include_angular_acceleration": false,
      "include_relative_acceleration": false,
      "include_relative_rotation": false,
      "include_relative_yaw": false,
      "include_accelerometer_magnitude": false,
      "include_gyroscope_magnitude": false,
      "include_gravity_free_linear_acceleration": false
    }
  }
}